app/controllers/posts_controller.rb

  def index
    # provide list of authors to the view for the filter controls
    @authors = Author.all

    # filter @posts list based on user input
    if !params[:author].blank?
      @posts = Post.where(author: params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day
      else
        @posts = Post.where("created_at <?"), Time.zone.today.beginning_of_day
      end
    else
      # if no filters, show all posts
      @posts = Post.all
    end
  end

  def show
    @post = Post.find(params[:id])
  end

  def new
    @post = Post.new
  end

  def create
    @post = Post.new(params)
    @post.save
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]